{"keras_version": "2.1.2", "config": {"input_layers": [["user", 0, 0], ["movie", 0, 0], ["age", 0, 0], ["occupation", 0, 0]], "name": "model_1", "layers": [{"name": "age", "config": {"name": "age", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "occupation", "config": {"name": "occupation", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "embedding_2", "config": {"output_dim": 5, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_2", "input_dim": 57, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["age", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "embedding_4", "config": {"output_dim": 5, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_4", "input_dim": 21, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["occupation", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "flatten_3", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_3", "config": {"kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_3", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_3", "momentum": 0.99, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_4", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_4", "momentum": 0.99, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "dropout_2", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_2", "seed": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dropout_3", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_3", "seed": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "user", "config": {"name": "user", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "movie", "config": {"name": "movie", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}], ["dropout_3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "embedding_6", "config": {"output_dim": 5, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_6", "input_dim": 6041, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["user", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "embedding_8", "config": {"output_dim": 5, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_8", "input_dim": 3953, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["movie", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "dense_5", "config": {"kernel_regularizer": null, "name": "dense_5", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dot_1", "config": {"name": "dot_1", "axes": -1, "trainable": true, "normalize": false}, "inbound_nodes": [[["embedding_6", 0, 0, {}], ["embedding_8", 0, 0, {}]]], "class_name": "Dot"}, {"name": "embedding_7", "config": {"output_dim": 1, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_7", "input_dim": 6041, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["user", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "embedding_9", "config": {"output_dim": 1, "mask_zero": false, "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "embeddings_constraint": null, "name": "embedding_9", "input_dim": 3953, "trainable": true, "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["movie", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "batch_normalization_5", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_5", "momentum": 0.99, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["embedding_7", 0, 0, {}], ["embedding_9", 0, 0, {}]]], "class_name": "Add"}, {"name": "dropout_4", "config": {"noise_shape": null, "rate": 0.4, "trainable": true, "name": "dropout_4", "seed": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_4", "config": {"name": "flatten_4", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "concatenate_2", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "inbound_nodes": [[["dropout_4", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense_6", "config": {"kernel_regularizer": null, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_6", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_6", "momentum": 0.99, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["dense_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "dropout_5", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_5", "seed": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_7", "config": {"kernel_regularizer": null, "name": "dense_7", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["dense_7", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}