{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "dtype": "float32", "trainable": false, "activity_regularizer": null, "output_dim": 200, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, null], "embeddings_regularizer": null, "mask_zero": false, "input_length": null, "input_dim": 64673}}, {"class_name": "GRU", "config": {"return_sequences": false, "unroll": false, "dropout": 0.2, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "gru_1", "go_backwards": false, "stateful": false, "return_state": false, "units": 256, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}], "keras_version": "2.1.2"}